[NoCoverage] ProtectedVisibility
DomainObject/AbstractRepository.php:13:5
     {
     }
 
-    protected function sortEvents(array $events): array
+    private function sortEvents(array $events): array
     {
         $sortedEvents = [];

[NoCoverage] Foreach_
DomainObject/AbstractRepository.php:17:9
     {
         $sortedEvents = [];
 
-        foreach ($events as $event) {
-            $sortedEvents[$event->correlationId][] = $event;
-        }
+        foreach ([] as $event) {
 
         return $sortedEvents;

[NoCoverage] ProtectedVisibility
DomainObject/AbstractRepository.php:24:5
         return $sortedEvents;
     }
 
-    protected function buildPostsFromEvents(array $postEvents): array
+    private function buildPostsFromEvents(array $postEvents): array
     {
         $posts = [];

[NoCoverage] Foreach_
DomainObject/AbstractRepository.php:28:9
     {
         $posts = [];
 
-        foreach ($postEvents as $events) {
-            $posts[] = $this->getRelevantDomainObject()::fromEvents($events);
-        }
+        foreach ([] as $events) {
 
         return $posts;
