[Killed] MethodCallRemoval
DomainObject/Post/Post.php:22:9
 
         $that = new self();
 
-        $that->recordEvent($createdEvent);
+        
 
         return $that;
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
Error: Typed property Ruvos\Blog\DomainObject\Post\Post::$title must not be accessed before initialization

/var/www/html/src/DomainObject/Post/Post.php:30
/var/www/html/tests/Unit/Post/PostTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
DomainObject/Post/Post.php:27:5
         return $that;
     }
 
-    public static function fromEvents(mixed $events): self
+    protected static function fromEvents(mixed $events): self
     {
         $that = new self();
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Post::fromEvents() from scope Blog\Tests\Unit\Post\PostTest

/var/www/html/tests/Unit/Post/PostTest.php:35

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Killed] Foreach_
DomainObject/Post/Post.php:31:9
     {
         $that = new self();
 
-        foreach ($events as $event) {
-            $that->applyEvent($event);
-        }
+        foreach ([] as $event) {
 
         return $that;
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
Error: Typed property Ruvos\Blog\DomainObject\Post\Post::$title must not be accessed before initialization

/var/www/html/src/DomainObject/Post/Post.php:30
/var/www/html/tests/Unit/Post/PostTest.php:38

ERRORS!
Tests: 2, Assertions: 4, Errors: 1.

[Killed] MethodCallRemoval
DomainObject/Post/Post.php:32:13
         $that = new self();
 
         foreach ($events as $event) {
-            $that->applyEvent($event);
+            
         }
 
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
Error: Typed property Ruvos\Blog\DomainObject\Post\Post::$title must not be accessed before initialization

/var/www/html/src/DomainObject/Post/Post.php:30
/var/www/html/tests/Unit/Post/PostTest.php:38

ERRORS!
Tests: 2, Assertions: 4, Errors: 1.
