[Killed] Identical
Database/SqLiteEventStore.php:18:9
 
     private function getConnection(): \PDO
     {
-        if (null === $this->pdo) {
+        if (null !== $this->pdo) {
             $this->pdo = new \PDO($this->dsn);
 
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
TypeError: Ruvos\Blog\Database\SqLiteEventStore::getConnection(): Return value must be of type PDO, null returned

/var/www/html/src/Database/SqLiteEventStore.php:19
/var/www/html/src/Database/SqLiteEventStore.php:24
/var/www/html/tests/Integration/SqLiteEventStoreTest.php:35

ERRORS!

[Killed] MethodCallRemoval
Database/SqLiteEventStore.php:21:13
         if (null === $this->pdo) {
             $this->pdo = new \PDO($this->dsn);
 
-            $this->createSchema();
+            
         }
         return $this->pdo;
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
PDOException: SQLSTATE[HY000]: General error: 1 no such table: events

/var/www/html/src/Database/SqLiteEventStore.php:26
/var/www/html/tests/Integration/SqLiteEventStoreTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Database/SqLiteEventStore.php:31:9
         $payload = $event->toJson();
 
         $connection = $this->getConnection();
-        $connection->beginTransaction();
+        
 
         $statement = $connection->prepare('
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
PDOException: There is no active transaction

/var/www/html/src/Database/SqLiteEventStore.php:42
/var/www/html/tests/Integration/SqLiteEventStoreTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Database/SqLiteEventStore.php:48:9
                               :payload
                               )
                               ');
-        $statement->execute(
-            [
-                ':eventId' => $event->eventId,
-                ':correlationId' => $event->correlationId,
-                ':topic' => $event->getTopic(),
-                ':createdAt' => $event->createdAt->format('Y-m-d H:i:s.u'),
-                ':payload' => $payload
-            ]
-        );
+        
 
         $connection->commit();
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
Failed asserting that actual size 0 matches expected size 1.

/var/www/html/tests/Integration/SqLiteEventStoreTest.php:41

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] MethodCallRemoval
Database/SqLiteEventStore.php:58:9
             ]
         );
 
-        $connection->commit();
+        
     }
 

[Killed] MethodCallRemoval
Database/SqLiteEventStore.php:63:9
 
     private function createSchema(): void
     {
-        $this->pdo->exec('
-        CREATE TABLE IF NOT EXISTS events (
-            eventId VARCHAR(36) PRIMARY KEY,
-            correlationId VARCHAR(36),
-            topic TEXT,
-            createdAt TEXT,
-            payload LONGTEXT
-        )');
+        
 
         $this->pdo->exec('CREATE INDEX IF NOT EXISTS idx_correlation_id ON events (correlationId)');
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
PDOException: SQLSTATE[HY000]: General error: 1 no such table: main.events

/var/www/html/src/Database/SqLiteEventStore.php:47
/var/www/html/src/Database/SqLiteEventStore.php:17
/var/www/html/src/Database/SqLiteEventStore.php:24
/var/www/html/tests/Integration/SqLiteEventStoreTest.php:35

[Survived] MethodCallRemoval
Database/SqLiteEventStore.php:72:9
             payload LONGTEXT
         )');
 
-        $this->pdo->exec('CREATE INDEX IF NOT EXISTS idx_correlation_id ON events (correlationId)');
+        
         $this->pdo->exec('CREATE INDEX IF NOT EXISTS idx_topic ON events (topic)');
     }

[Survived] MethodCallRemoval
Database/SqLiteEventStore.php:73:9
         )');
 
         $this->pdo->exec('CREATE INDEX IF NOT EXISTS idx_correlation_id ON events (correlationId)');
-        $this->pdo->exec('CREATE INDEX IF NOT EXISTS idx_topic ON events (topic)');
+        
     }
 

[Killed] MethodCallRemoval
Database/SqLiteEventStore.php:80:9
     {
         $statement = $this->pdo->prepare('SELECT * FROM events');
 
-        $statement->execute();
+        
         $eventsArray = $statement->fetchAll(\PDO::FETCH_NAMED);
 
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
Failed asserting that actual size 0 matches expected size 1.

/var/www/html/tests/Integration/SqLiteEventStoreTest.php:41

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Database/SqLiteEventStore.php:85:9
 
         $events = [];
 
-        foreach ($eventsArray as $eventArray) {
-            switch ($eventArray['topic']) {
-                case PostCreatedEvent::getTopic():
-                    $events[] = PostCreatedEvent::fromJson($eventArray['payload']);
-            }
-        }
+        foreach ([] as $eventArray) {
 
         return $events;
killedBy: Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
statusReason: 1) Blog\Tests\Integration\SqLiteEventStoreTest::testSaveIsValid
Failed asserting that actual size 0 matches expected size 1.

/var/www/html/tests/Integration/SqLiteEventStoreTest.php:41

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
