[Killed] ProtectedVisibility
DomainObject/AbstractEvent.php:9:5
 
 abstract readonly class AbstractEvent implements Event
 {
-    protected function __construct(
+    private function __construct(public string $correlationId, public string $eventId, public \DateTimeInterface $createdAt)
         public string $correlationId,
         public string $eventId,
killedBy: Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
statusReason: 1) Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
Error: Cannot call private Ruvos\Blog\DomainObject\AbstractEvent::__construct()

/var/www/html/src/DomainObject/Post/Event/PostCreatedEvent.php:29
/var/www/html/src/DomainObject/Post/Event/PostCreatedEvent.php:39
/var/www/html/tests/Unit/Post/Event/PostCreatedEventTest.php:59

ERRORS!
