[Survived] MethodCallRemoval
DomainObject/Content/Event/TextContentCreatedEvent.php:26:9
         \DateTimeInterface $createdAt,
         public string $content
     ) {
-        parent::__construct($correlationId, $eventId, $createdAt);
+        
     }
 

[Killed] PublicVisibility
DomainObject/Content/Event/TextContentCreatedEvent.php:30:5
     }
 
 
-    public static function create(string $content): self
+    protected static function create(string $content): self
     {
         $createdAt = DefaultDateTimeProvider::now();
killedBy: Blog\Tests\Unit\Content\Event\TextContentCreatedEventTest::testCreateTextContentCreatedEventIsValid
statusReason: 1) Blog\Tests\Unit\Content\Event\TextContentCreatedEventTest::testCreateTextContentCreatedEventIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Content\Event\TextContentCreatedEvent::create() from scope Blog\Tests\Unit\Content\Event\TextContentCreatedEventTest

/var/www/html/tests/Unit/Content/Event/TextContentCreatedEventTest.php:19

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.
