[Killed] MethodCallRemoval
DomainObject/Content/TextContent.php:21:9
         $createdEvent = TextContentCreatedEvent::create($content);
 
         $that = new self();
-        $that->recordEvent($createdEvent);
+        
 
         return $that;
killedBy: Blog\Tests\Unit\Content\TextContentTest::testCreateIsValid
statusReason: 1) Blog\Tests\Unit\Content\TextContentTest::testCreateIsValid
Failed asserting that actual size 0 matches expected size 1.

/var/www/html/tests/Unit/Content/TextContentTest.php:33

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Survived] MethodCallRemoval
DomainObject/Content/TextContent.php:30:17
     {
         switch ($event::getTopic()) {
             case TextContentCreatedEvent::getTopic():
-                $this->applyTextContentCreatedEvent($event);
+                
                 break;
             default:

[Killed] Throw_
DomainObject/Content/TextContent.php:33:17
                 $this->applyTextContentCreatedEvent($event);
                 break;
             default:
-                throw DomainObjectException::unsupportedEvent($event);
+                DomainObjectException::unsupportedEvent($event);
         }
     }
killedBy: Blog\Tests\Unit\Content\TextContentTest::testApplyInvalidEventThrowsException
statusReason: 1) Blog\Tests\Unit\Content\TextContentTest::testApplyInvalidEventThrowsException
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Event "Ruvos\Blog\DomainObject\Post\Event\PostCreatedEvent" is not supported.'
+'Should throw exception'
