[Killed] PublicVisibility
DomainObject/Post/Event/PostCreatedEvent.php:32:5
         parent::__construct($correlationId, $eventId, $createdAt);
     }
 
-    public static function create(string $title): Event
+    protected static function create(string $title): Event
     {
         $createdAt = DefaultDateTimeProvider::now();
killedBy: Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
statusReason: 1) Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Event\PostCreatedEvent::create() from scope Blog\Tests\Unit\Post\Event\PostCreatedEventTest

/var/www/html/tests/Unit/Post/Event/PostCreatedEventTest.php:59

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
DomainObject/Post/Event/PostCreatedEvent.php:42:5
         return new self($eventId, $correlationId, $createdAt, $title, $state);
     }
 
-    public static function fromJson(string $payload)
+    protected static function fromJson(string $payload)
     {
         $data = json_decode($payload, true, 512, JSON_THROW_ON_ERROR);
killedBy: Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
statusReason: 1) Blog\Tests\Unit\Post\Event\PostCreatedEventTest::testFromJsonIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Event\PostCreatedEvent::fromJson() from scope Blog\Tests\Unit\Post\Event\PostCreatedEventTest

/var/www/html/tests/Unit/Post/Event/PostCreatedEventTest.php:60

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] DecrementInteger
DomainObject/Post/Event/PostCreatedEvent.php:44:9
 
     public static function fromJson(string $payload)
     {
-        $data = json_decode($payload, true, 512, JSON_THROW_ON_ERROR);
+        $data = json_decode($payload, true, 511, JSON_THROW_ON_ERROR);
         return new self(
             $data['eventId'],

[Survived] IncrementInteger
DomainObject/Post/Event/PostCreatedEvent.php:44:9
 
     public static function fromJson(string $payload)
     {
-        $data = json_decode($payload, true, 512, JSON_THROW_ON_ERROR);
+        $data = json_decode($payload, true, 513, JSON_THROW_ON_ERROR);
         return new self(
             $data['eventId'],
