[Killed] PublicVisibility
DomainObject/Post/Post.php:21:5
 
     private array $body;
 
-    public static function create(string $title): self
+    protected static function create(string $title): self
     {
         $createdEvent = PostCreatedEvent::create($title);
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Post::create() from scope Blog\Tests\Unit\Post\PostTest

/var/www/html/tests/Unit/Post/PostTest.php:26

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
DomainObject/Post/Post.php:31:5
         return $that;
     }
 
-    public function getTitle(): string
+    protected function getTitle(): string
     {
         return $this->title;
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Post::getTitle() from scope Blog\Tests\Unit\Post\PostTest

/var/www/html/tests/Unit/Post/PostTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
DomainObject/Post/Post.php:36:5
         return $this->title;
     }
 
-    public function getState(): State
+    protected function getState(): State
     {
         return $this->state;
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateExistingFromEventsIsValid
Error: Call to protected method Ruvos\Blog\DomainObject\Post\Post::getState() from scope Blog\Tests\Unit\Post\PostTest

/var/www/html/tests/Unit/Post/PostTest.php:41

ERRORS!
Tests: 2, Assertions: 5, Errors: 1.

[Killed] MethodCallRemoval
DomainObject/Post/Post.php:45:17
     {
         switch ($event::getTopic()) {
             case PostCreatedEvent::getTopic():
-                $this->applyPostCreatedEvent($event);
+                
                 break;
             case TextContentAddedEvent::getTopic():
killedBy: Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
statusReason: 1) Blog\Tests\Unit\Post\PostTest::testCreateNewPostIsValid
Error: Typed property Ruvos\Blog\DomainObject\Post\Post::$title must not be accessed before initialization

/var/www/html/src/DomainObject/Post/Post.php:25
/var/www/html/tests/Unit/Post/PostTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[NoCoverage] MethodCallRemoval
DomainObject/Post/Post.php:48:17
                 $this->applyPostCreatedEvent($event);
                 break;
             case TextContentAddedEvent::getTopic():
-                $this->applyTextContentAddedEvent($event);
+                
                 break;
             default:
