[NoCoverage] PublicVisibility
Kernel.php:17:5
 {
     private static Container $container;
 
-    public static function boot(): void
+    protected static function boot(): void
     {
         $container = new ContainerBuilder();

[NoCoverage] ConcatOperandRemoval
Kernel.php:21:9
     {
         $container = new ContainerBuilder();
 
-        $rootDir = dirname(__DIR__ . '../');
+        $rootDir = dirname('../');
         $configDir = $rootDir . '/config/services/';
 

[NoCoverage] Concat
Kernel.php:21:9
     {
         $container = new ContainerBuilder();
 
-        $rootDir = dirname(__DIR__ . '../');
+        $rootDir = dirname('../' . __DIR__);
         $configDir = $rootDir . '/config/services/';
 

[NoCoverage] ConcatOperandRemoval
Kernel.php:22:9
         $container = new ContainerBuilder();
 
         $rootDir = dirname(__DIR__ . '../');
-        $configDir = $rootDir . '/config/services/';
+        $configDir = $rootDir;
 
         $loader = new PhpFileLoader($container, new FileLocator($configDir));

[NoCoverage] ConcatOperandRemoval
Kernel.php:22:9
         $container = new ContainerBuilder();
 
         $rootDir = dirname(__DIR__ . '../');
-        $configDir = $rootDir . '/config/services/';
+        $configDir = '/config/services/';
 
         $loader = new PhpFileLoader($container, new FileLocator($configDir));

[NoCoverage] MethodCallRemoval
Kernel.php:25:9
         $configDir = $rootDir . '/config/services/';
 
         $loader = new PhpFileLoader($container, new FileLocator($configDir));
-        $loader->load('services.php');
+        
 
         $container->compile();

[NoCoverage] MethodCallRemoval
Kernel.php:27:9
         $loader = new PhpFileLoader($container, new FileLocator($configDir));
         $loader->load('services.php');
 
-        $container->compile();
+        
 
         self::$container = $container;

[NoCoverage] PublicVisibility
Kernel.php:34:5
 
 
 
-    public static function getContainer(): Container
+    protected static function getContainer(): Container
     {
         return self::$container;
